'use client';

import { motion } from 'framer-motion';
import Map from '../common/Map';

function Activity() {
  return (
    <motion.div
      className="w-full max-w-[1280px] mx-auto flex flex-col justify-start items-start gap-14 px-5 tablet:px-5"
      initial={{ opacity: 0, y: 50 }}
      whileInView={{ opacity: 1, y: 0 }}
      transition={{ duration: 0.5 }}
    >
      <h1 className="relative text-3xl font-[500] leading-normal">
        Our activity around the world!
        <span className="absolute w-[250px] mobile:w-full h-[5px] bg-primary bottom-[-10px] left-0 shadow-lg"></span>
      </h1>

      <div className="relative w-full h-[500px]">
        <Map coords={cities} zoom={5} scroll={false} />
      </div>
    </motion.div>
  );
}

export default Activity;

const cities = [
  {
    name: 'NΟΜΟΣ ΑΙΤΩΛΟΚΑΡΝΑΝΙΑΣ',
    coord: {
      lat: 38.43650746138648,
      lng: 21.353721762180847,
    },
  },
  {
    name: 'NΟΜΟΣ ΑΡΚΑΔΙΑΣ',
    coord: {
      lat: 37.522274535145996,
      lng: 22.37289644286303,
    },
  },
  {
    name: 'NΟΜΟΣ ΑΤΤΙΚΗΣ',
    coord: {
      lat: 37.99893518725359,
      lng: 23.721747827937,
    },
  },
  {
    name: 'NΟΜΟΣ ΑΧΑΙΑΣ',
    coord: {
      lat: 38.125770753931185,
      lng: 21.970140256469882,
    },
  },
  {
    name: 'NΟΜΟΣ ΒΟΙΩΤΙΑΣ',
    coord: {
      lat: 38.37361884889718,
      lng: 23.10447225651705,
    },
  },
  {
    name: 'NΟΜΟΣ ΓΡΕΒΕΝΩΝ',
    coord: {
      lat: 40.084116169819474,
      lng: 21.42751806654497,
    },
  },
  {
    name: 'NΟΜΟΣ ΙΩΑΝΝΙΝΩΝ',
    coord: {
      lat: 39.66643453554719,
      lng: 20.85319498513307,
    },
  },
  {
    name: 'NΟΜΟΣ ΔΡΑΜΑΣ',
    coord: {
      lat: 41.15016907464537,
      lng: 24.146191610902363,
    },
  },
  {
    name: 'NΟΜΟΣ ΕΒΡΟΥ',
    coord: {
      lat: 41.23172301358438,
      lng: 26.132036502115323,
    },
  },
  {
    name: 'NΟΜΟΣ ΕΥΒΟΙΑΣ',
    coord: {
      lat: 38.533600843064264,
      lng: 23.859155123163024,
    },
  },
  {
    name: 'NΟΜΟΣ ΘΕΣΠΡΩΤΙΑΣ',
    coord: {
      lat: 39.49048168474666,
      lng: 20.367109293377442,
    },
  },
  {
    name: 'NΟΜΟΣ ΗΜΑΘΙΑΣ',
    coord: {
      lat: 40.5964513910664,
      lng: 22.15060508539313,
    },
  },
  {
    name: 'NΟΜΟΣ ΗΡΑΚΛΕΙΟΥ',
    coord: {
      lat: 35.30009259343706,
      lng: 25.143825362280083,
    },
  },
  {
    name: 'NΟΜΟΣ ΘΕΣΣΑΛΟΝΙΚΗΣ',
    coord: {
      lat: 40.60310883286814,
      lng: 22.98630843728605,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΕΦΑΛΛΗΝΙΑΣ',
    coord: {
      lat: 38.19913277569868,
      lng: 20.566963955879856,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΑΒΑΛΑΣ',
    coord: {
      lat: 40.94901024912229,
      lng: 24.427484757874353,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΑΡΔΙΤΣΑΣ',
    coord: {
      lat: 39.36484070374383,
      lng: 21.921387600472737,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΙΛΚΙΣ',
    coord: {
      lat: 40.993852333183035,
      lng: 22.87380900781885,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΟΖΑΝΗΣ',
    coord: {
      lat: 40.281463615978225,
      lng: 21.78873288661876,
    },
  },
  {
    name: 'NΟΜΟΣ ΚΟΡΙΝΘΙΑΣ',
    coord: {
      lat: 37.942979691581215,
      lng: 22.60564564992257,
    },
  },
  {
    name: 'NΟΜΟΣ ΛΑΚΩΝΙΑΣ',
    coord: {
      lat: 37.06432685877403,
      lng: 22.438175872743372,
    },
  },
  {
    name: 'NΟΜΟΣ ΛΑΡΙΣΗΣ',
    coord: {
      lat: 39.636423764633186,
      lng: 22.41762256798015,
    },
  },
  {
    name: 'NΟΜΟΣ ΜΑΓΝΗΣΙΑΣ',
    coord: {
      lat: 39.37202645180913,
      lng: 22.909913824569497,
    },
  },
  {
    name: 'NΟΜΟΣ ΜΕΣΣΗΝΙΑΣ',
    coord: {
      lat: 37.06838393505621,
      lng: 21.999248915841363,
    },
  },
  {
    name: 'ΝΟΜΟΣ ΚΥΚΛΑΔΩΝ',
    coord: {
      lat: 36.67996264013333,
      lng: 24.376318449330608,
    },
  },
  {
    name: 'ΝΟΜΟΣ ΚΕΡΚΥΡΑΣ',
    coord: {
      lat: 39.61012941972539,
      lng: 19.836290038604453,
    },
  },
  {
    name: 'NΟΜΟΣ ΣΕΡΡΩΝ',
    coord: {
      lat: 40.90893580383521,
      lng: 23.499863720184937,
    },
  },
  {
    name: 'NΟΜΟΣ ΞΑΝΘΗΣ',
    coord: {
      lat: 40.90893580383521,
      lng: 23.499863720184937,
    },
  },
  {
    name: 'NΟΜΟΣ ΠΕΛΛΑΣ',
    coord: {
      lat: 0.95781000775332,
      lng: 22.06887664752494,
    },
  },
  {
    name: 'NΟΜΟΣ ΠΙΕΡΙΑΣ',
    coord: {
      lat: 40.26810622223032,
      lng: 22.465050797032156,
    },
  },
  {
    name: 'NΟΜΟΣ ΡΕΘΥΜΝΟΥ',
    coord: {
      lat: 35.36472278802503,
      lng: 24.490737105408158,
    },
  },
  {
    name: 'NΟΜΟΣ ΡΟΔΟΠΗΣ',
    coord: {
      lat: 41.1667585328777,
      lng: 25.400902899744892,
    },
  },
  {
    name: 'NΟΜΟΣ ΤΡΙΚΑΛΩΝ',
    coord: {
      lat: 39.55111476347776,
      lng: 21.76516231397934,
    },
  },
  {
    name: 'NΟΜΟΣ ΦΘΙΩΤΙΔΟΣ',
    coord: {
      lat: 38.88380118387963,
      lng: 22.42350037021561,
    },
  },
  {
    name: 'NΟΜΟΣ ΦΛΩΡΙΝΑΣ',
    coord: {
      lat: 40.783240047264336,
      lng: 21.41059684211864,
    },
  },
  {
    name: 'NΟΜΟΣ ΧΑΛΚΙΔΙΚΗΣ',
    coord: {
      lat: 40.26846619165557,
      lng: 23.631356857571728,
    },
  },
  {
    name: 'NΟΜΟΣ ΧΑΝΙΩΝ',
    coord: {
      lat: 35.511897728151254,
      lng: 24.017787596392854,
    },
  },
];
